# SlopeZero Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlopeZero Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
Adjusting this Line's Overhang will not affect its height because its slope is zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlopeZero { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlopeZero As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlopeZero {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace